In [4]:
import numpy as np

In [11]:
np.array([1,2,3,4])

array([1, 2, 3, 4])

In [12]:
a = np.array([1,2,3,4])

In [13]:
type(a)

numpy.ndarray

In [15]:
np.array([1.2,2,35,4],dtype = "int")

array([ 1,  2, 35,  4])

In [16]:
np.zeros(10,dtype="int")

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [17]:
np.random.randint(0,10,(3,4))

array([[7, 2, 2, 7],
       [2, 6, 8, 3],
       [8, 9, 1, 8]])

In [18]:
np.random.randint(10,size = 10)

array([2, 6, 8, 8, 1, 4, 7, 6, 9, 7])

In [19]:
a = np.random.randint(10,size = 10)

In [21]:
a.dtype

dtype('int32')

In [22]:
a.size

10

In [23]:
b = np.random.randint(10,size = (3,5))

In [24]:
b.size

15

In [25]:
b.ndim

2

In [26]:
b.shape

(3, 5)

In [27]:
b.dtype

dtype('int32')

In [28]:
np.arange(1,10)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [29]:
np.arange(1,10).reshape(3,3)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [30]:
a = np.arange(1,10)

In [31]:
a.ndim

1

In [32]:
a.reshape((1,9))

array([[1, 2, 3, 4, 5, 6, 7, 8, 9]])

In [33]:
a = np.array([1,2,3])

In [34]:
b = np.array([4,5,6])

In [ ]:
np.concatenate

In [35]:
a = np.array([[1,2,3],[4,5,6]])

In [36]:
a = np.array([1,2,3,99,99,3,2,1])

In [39]:
np.split(a, [3,5])

[array([1, 2, 3]),
 array([99, 99]),
 array([], dtype=int32),
 array([99, 99,  3,  2,  1])]

In [40]:
a,b,c = np.split(a, [3,5])

In [41]:
a

array([1, 2, 3])

In [42]:
b

array([99, 99])

In [43]:
c

array([3, 2, 1])

In [50]:
v = np.array([2,1,4,3,5])

In [52]:
np.sort(v)

array([1, 2, 3, 4, 5])

In [48]:
v.sort()

In [49]:
v

array([1, 2, 3, 4, 5])

In [51]:
v

array([2, 1, 4, 3, 5])

In [53]:
v

array([2, 1, 4, 3, 5])

In [54]:
a = np.sort(v)

In [55]:
a

array([1, 2, 3, 4, 5])

In [56]:
m = np.random.normal(20,5, (3,3))

In [57]:
m

array([[14.05791546, 20.74920377, 16.9258409 ],
       [20.77888321, 20.78947945, 14.82098247],
       [17.06985801, 19.12817317, 21.42578743]])

In [61]:
m = np.random.randint(1,10, (3,3))

In [62]:
m

array([[4, 5, 3],
       [4, 7, 9],
       [4, 9, 5]])

In [5]:
a = np.arange(20,30)

In [6]:
a

array([20, 21, 22, 23, 24, 25, 26, 27, 28, 29])

In [7]:
a[0:3]

array([20, 21, 22])

In [8]:
a[3:]

array([23, 24, 25, 26, 27, 28, 29])

In [9]:
m = np.random.randint(10,size = [5,5])

In [10]:
m

array([[9, 0, 7, 2, 2],
       [3, 9, 3, 5, 9],
       [6, 3, 5, 9, 2],
       [6, 6, 1, 4, 6],
       [4, 7, 8, 4, 7]])

In [11]:
m[:,0]

array([9, 3, 6, 6, 4])

In [12]:
m[:,1]

array([0, 9, 3, 6, 7])

In [13]:
m[1,:]

array([3, 9, 3, 5, 9])

In [14]:
m[0:2,0:3]

array([[9, 0, 7],
       [3, 9, 3]])

In [15]:
m[1:3,0:2]

array([[3, 9],
       [6, 3]])

In [16]:
import numpy as np
a = np.random.randint(10, size = (5, 5))
a

array([[6, 8, 8, 8, 2],
       [5, 2, 0, 1, 9],
       [7, 4, 7, 4, 8],
       [0, 5, 2, 4, 6],
       [9, 1, 6, 0, 4]])

In [17]:
alt_a = a[0:3,:2]

In [18]:
alt_a

array([[6, 8],
       [5, 2],
       [7, 4]])

In [20]:
alt_a[0:0]

array([], shape=(0, 2), dtype=int32)

In [23]:
alt_a

array([[6, 8],
       [5, 2],
       [7, 4]])

In [25]:
alt_a[0:0] = 99

In [24]:
alt_a

array([[6, 8],
       [5, 2],
       [7, 4]])

In [26]:
alt_a

array([[6, 8],
       [5, 2],
       [7, 4]])

In [27]:
alt_a[0:1] = 100

In [28]:
alt_a

array([[100, 100],
       [  5,   2],
       [  7,   4]])

In [29]:
a

array([[100, 100,   8,   8,   2],
       [  5,   2,   0,   1,   9],
       [  7,   4,   7,   4,   8],
       [  0,   5,   2,   4,   6],
       [  9,   1,   6,   0,   4]])

In [30]:
m = np.random.randint(10, size = (5, 5))
m

array([[7, 2, 9, 9, 3],
       [0, 0, 4, 7, 4],
       [5, 4, 3, 2, 3],
       [8, 9, 3, 5, 2],
       [3, 8, 1, 4, 6]])

In [31]:
alt_b = m[0:3,:2].copy()

In [32]:
alt_b

array([[7, 2],
       [0, 0],
       [5, 4]])

In [33]:
alt_b[0,0] = 99

In [34]:
alt_b

array([[99,  2],
       [ 0,  0],
       [ 5,  4]])

In [35]:
m

array([[7, 2, 9, 9, 3],
       [0, 0, 4, 7, 4],
       [5, 4, 3, 2, 3],
       [8, 9, 3, 5, 2],
       [3, 8, 1, 4, 6]])

In [36]:
 m = np.arange(9).reshape((3,3))

In [37]:
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [38]:
satir = np.array([0,1])
sutun = np.array([1,2])

In [39]:
m[satir, sutun]

array([1, 5])

In [40]:
import numpy as np
v = np.array([1, 2, 3, 4, 5])

In [41]:
v*2

array([ 2,  4,  6,  8, 10])

In [42]:
v

array([1, 2, 3, 4, 5])

In [43]:
v = np.array([1, 2, 3, 4, 5])

In [44]:
v

array([1, 2, 3, 4, 5])

In [45]:
v[-2]

4

In [46]:
v[-3]

3

In [47]:
import pandas as pd

In [48]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [49]:
a = pd.Series([10,88,3,4,5])

In [50]:
a

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [51]:
type(a)

pandas.core.series.Series

In [52]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [53]:
a = np.array([1,2,33,444,75])

In [54]:
import pandas as pd

In [56]:
seri = pd.Series(a)

In [57]:
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [58]:
seri[0:2]

0    1
1    2
dtype: int32

In [59]:
l = [1,2,39,67,90]

In [60]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [61]:
m = np.arrange(1,10).reshape((3,3))

AttributeError: module 'numpy' has no attribute 'arrange'

In [62]:
import numpy as np

In [63]:
m = np.arrange(1,10).reshape((3,3))

AttributeError: module 'numpy' has no attribute 'arrange'

In [64]:
m = np.arange(1,10).reshape((3,3))

In [65]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [66]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [67]:
df.head

<bound method NDFrame.head of    var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9>

In [68]:
df.columns = ("deg1","deg2","deg3")

In [69]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [70]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [71]:
sozluk = {"var1" : s1,"var2" : s2,"var3" : s3}

In [72]:
sozluk

{'var1': array([5, 0, 7, 4, 8]),
 'var2': array([0, 2, 3, 9, 7]),
 'var3': array([5, 9, 9, 3, 8])}

In [73]:
s1

array([5, 0, 7, 4, 8])

In [74]:
df = pd.DataFrame(sozluk)

In [75]:
df

   var1  var2  var3
0     5     0     5
1     0     2     9
2     7     3     9
3     4     9     3
4     8     7     8

In [76]:
df[0:1]

   var1  var2  var3
0     5     0     5

In [77]:
df.index = ["a","b","c","d","e"]

In [78]:
df["c":"e"]

   var1  var2  var3
c     7     3     9
d     4     9     3
e     8     7     8

In [79]:
df

   var1  var2  var3
a     5     0     5
b     0     2     9
c     7     3     9
d     4     9     3
e     8     7     8

In [80]:
df.drop("a", axis = 0)

   var1  var2  var3
b     0     2     9
c     7     3     9
d     4     9     3
e     8     7     8

In [ ]:
df.drop("a", axis = 0, inplace = True)

In [81]:
df.drop(["c","d"], axis = 0)

   var1  var2  var3
a     5     0     5
b     0     2     9
e     8     7     8

In [83]:
"var1" in df

True

In [84]:
l =["var1","var4","var3"]

In [85]:
["var1","var4","var3"] in df

TypeError: unhashable type: 'list'

In [87]:
for i in ["var1","var4","var3"]:
    print(i in df)

True
False
True

In [88]:
for i in l:
    print(i in df)

True
False
True

In [89]:
df

   var1  var2  var3
a     5     0     5
b     0     2     9
c     7     3     9
d     4     9     3
e     8     7     8

In [90]:
df["var4"] = df["var1"] / df["var2"]

In [91]:
df

   var1  var2  var3      var4
a     5     0     5       inf
b     0     2     9  0.000000
c     7     3     9  2.333333
d     4     9     3  0.444444
e     8     7     8  1.142857

In [92]:
df.drop("var4", axis = 1)

   var1  var2  var3
a     5     0     5
b     0     2     9
c     7     3     9
d     4     9     3
e     8     7     8

In [93]:
df.drop("var4", axis = 1 , inplace = True)

In [94]:
df

   var1  var2  var3
a     5     0     5
b     0     2     9
c     7     3     9
d     4     9     3
e     8     7     8

In [95]:
l = ["var1","var2"]

In [96]:
df.drop(l,axis = 1)

   var3
a     5
b     9
c     9
d     3
e     8

In [97]:
df.drop(l,axis = 0)

KeyError: "['var1', 'var2'] not found in axis"

In [98]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    11    23    17
1    25     9    14
2    29     3     9
3    10    22    29
4    25    25     6
5     2    10    18
6     8    28    26
7     4    14     3
8    11    18    24
9     6     3    22

In [100]:
df

   var1  var2  var3
0    11    23    17
1    25     9    14
2    29     3     9
3    10    22    29
4    25    25     6
5     2    10    18
6     8    28    26
7     4    14     3
8    11    18    24
9     6     3    22

In [101]:
df.loc[0:3]

   var1  var2  var3
0    11    23    17
1    25     9    14
2    29     3     9
3    10    22    29

In [102]:
df.iloc[0:3]

   var1  var2  var3
0    11    23    17
1    25     9    14
2    29     3     9

In [104]:
df.iloc[0,0]

11

In [105]:
df.loc[0:3,"var3"]

0    17
1    14
2     9
3    29
Name: var3, dtype: int32

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    15     3     1
1    13    17     3
2    23    25    11
3    25     8    23
4    13    25    18
5    20    26    23
6     2    12    15
7    26    13    11
8    18    21    13
9    10     9    10

In [2]:
df[0:2][["var1","var2"]]

   var1  var2
0    15     3
1    13    17

In [3]:
df.var1

0    15
1    13
2    23
3    25
4    13
5    20
6     2
7    26
8    18
9    10
Name: var1, dtype: int32

In [4]:
df[df.var1 > 15]

   var1  var2  var3
2    23    25    11
3    25     8    23
5    20    26    23
7    26    13    11
8    18    21    13

In [9]:
df[(df.var1 > 15) & (df.var3 < 20)]

   var1  var2  var3
2    23    25    11
7    26    13    11
8    18    21    13

In [12]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0     1    11     9
1     2    12    18
2     7     2    19
3    16    13    21
4    25    21    22

In [13]:
df2 = df1 +4

In [14]:
df2

   var1  var2  var3
0     5    15    13
1     6    16    22
2    11     6    23
3    20    17    25
4    29    25    26

In [15]:
pd.concat([df1,df2])

   var1  var2  var3
0     1    11     9
1     2    12    18
2     7     2    19
3    16    13    21
4    25    21    22
0     5    15    13
1     6    16    22
2    11     6    23
3    20    17    25
4    29    25    26

In [16]:
pd.concat([df1,df2], ignore_index=False)

   var1  var2  var3
0     1    11     9
1     2    12    18
2     7     2    19
3    16    13    21
4    25    21    22
0     5    15    13
1     6    16    22
2    11     6    23
3    20    17    25
4    29    25    26

In [17]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0     1    11     9
1     2    12    18
2     7     2    19
3    16    13    21
4    25    21    22
5     5    15    13
6     6    16    22
7    11     6    23
8    20    17    25
9    29    25    26

In [20]:
df2.columns = ["var1","var2","deg3"]

In [21]:
df2

   var1  var2  deg3
0     5    15    13
1     6    16    22
2    11     6    23
3    20    17    25
4    29    25    26

In [22]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3  deg3
0     1    11   9.0   NaN
1     2    12  18.0   NaN
2     7     2  19.0   NaN
3    16    13  21.0   NaN
4    25    21  22.0   NaN
5     5    15   NaN  13.0
6     6    16   NaN  22.0
7    11     6   NaN  23.0
8    20    17   NaN  25.0
9    29    25   NaN  26.0

In [24]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0     1    11
1     2    12
2     7     2
3    16    13
4    25    21
0     5    15
1     6    16
2    11     6
3    20    17
4    29    25

In [26]:
pd.concat([df1,df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [27]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\anaconda\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [28]:
pd.concat([df1,df2], join_axis = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axis'

In [29]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [30]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [31]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [32]:
df3 = pd.merge(df1,df2)

In [33]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [34]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [35]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [36]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [37]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [38]:
import seaborn as sns

In [41]:
df = sns.load_dataset

Object `df = sns.load_dataset` not found.

In [42]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\anaconda\lib\site-packages\seaborn\utils.py
Type:      function

In [43]:
df = sns.load_dataset("planets")

In [44]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [46]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [47]:
df.shape

(1035, 6)

In [48]:
df.size

6210

In [50]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [51]:
df.min()

method            Astrometry
number                     1
orbital_period      0.090706
mass                  0.0036
distance                1.35
year                    1989
dtype: object

In [53]:
df["mass"].mean()

2.6381605847953233

In [54]:
df["mass"].max()

25.0

In [55]:
df["mass"].sum()

1353.37638

In [56]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [57]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [58]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [59]:
df.groupby("gruplar")

In [60]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [61]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [62]:
df.groupby("gruplar").max()

         veri
gruplar
A          23
B          43
C          55

In [63]:
df = sns.load_dataset("planets")

In [64]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [65]:
df.groupby("method")

In [66]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [68]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [70]:
df.dropna().groupby("method")["mass"].mean()

method
Radial Velocity    2.511411
Transit            1.470000
Name: mass, dtype: float64

In [71]:
df.groupby("method")["mass"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [72]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [73]:
df.groupby("gruplar")

In [74]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [75]:
df.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [76]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [77]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [78]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [79]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [80]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [81]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [82]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [ ]:
df.transform()

In [86]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [87]:
df.groupby("gruplar").apply(np.mean)

C:\Anaconda\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Anaconda\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0